/*
1. 다음 각 용어의 의미를 설명하시오.
데이터베이스 - 필요한 정보를 얻기 위해 논리적으로 연관된 데이터를 모아 구조적으로 통합해 놓은 것.
DBMS - 데이터베이스 관리 시스템. 주기억장치에 있는 소프트웨어로, 쿼리를 처리하고나 DML, DDL 등을 처리한다.
데이터 모델 - 데이터베이스 시스템에서 데이터를 저장하는 이론적인 방법. 데이터베이스에서 데이터가 어떻게 구조화되는지를 결정한다.
데이터베이스 시스템 - 데이터베이스 + DBMS + 데이터 모델

2. 데이터 베이스의 개념 네 가지를 설명하시오.
1) 데이터에 통합된 데이터
2) 저장된 데이터
3) 운영 데이터
4) 공용 데이터

3. 데이터베이스의 특징 네 가지를 설명하시오.
1) 실시간 접근성
2) 계속적인 변화
3) 동시 공유
4) 내용에 따른 참조

4. 파일 시스템과 DBMS의 데이터 접근 방법의 차이를 설명하시오. 
파일 시스템은 사용자가 데이터에 직접 접근하지만 DBMS는 쿼리를 이용해서 간접적으로 접근한다.

5. 파일 시스템과 DBMS의 장단점 설명하시오.
파일 시스템은 데이터를 파일 단위로 저장하므로 중복 가능성 높은 반면, DBMS는 데이터를 공유하기 때문에 중복 가능성 낮다.
파일 시스템은 데이터 정의 와 프로그램의 독립성 유지가 불가능한 반면, DBMS는 데이터 정의와 프로그램의 독립성을 유지할 수 있다.
파일 시스템은 별도의 소프트웨어 설치 필요 없다. DBMS는 별도의 컴퓨터 리소스 많이 쓴다.

6. 데이터 모델을 설명하고 종류를 나열하시오.
계층 데이터 모델, 네트워크 데이터 모델, 관계 데이터 모델, 객체 데이터 모델

7. 다음 데이터베이스 사용자들의 역할을 설명하시오.
1) 일반 사용자 - 응용 프로그램 통해서 DB에 접근.
2) 응용 프로그래머 - 일반 사용자를 위한 인터페이스 및 데이터를 관리하는 응용 로직 개발.
3) SQL 사용자 - SQL 이용해서 DB에서 데이터 뽑아냄
4) DBA - DB 관리하는 사람

8. 데이터 독립성을 정의하고, 데이터베이스 시스템에서 그 중요성을 설명하시오.
3단계 데이터베이스 구조에서 하위 단계 내용을 추상화해서 상위 단계에 그 세부사항을 숨기는 것. 단계 내의 변경에 대해서 다음 단계에 상호 간섭이 없도록 만드는 것.

9. ANSI의 3단계 데이터베이스 구조에 대해 설명하시오.
외부 스키마 - 일반 사용자/응용 프로그래머가 접근하는 단계. 서브스키마 혹은 뷰. 전체 DB의 일부분.
개념 스키마 - 전체 DB에 대한 정의. 데이터와 관계, 제약사항, 무결성에 대한 내용 포함.
내부 스키마 - 데이터가 하드에 저장되는 물리적인 구조 나타냄.

10. 클라이언트/서버 구조를 설명하고, 2-tier, 3-tier 개념을 설명하시오.
2 Tier - Client Tier와 Data Tier로 나눈다.
Client Tier에는 Application Layer(프레젠테이션 로직, 비즈니스 로직)가 있고 Data Tier에는 Data Layer(Data Access logic)가 있다.
클라이언트와 서버를 분리하여 데이터베이스 변경이 용이하다.  HTML, Javascript, CSS

3 Tier - Client Tier, Application Tier, Data Tier로 나눈다.
Ref - https://www.stevenjlee.net/2020/05/08/%EC%9D%B4%ED%95%B4%ED%95%98%EA%B8%B0-3%EA%B3%84%EC%B8%B5-%EA%B5%AC%EC%A1%B0-3-tier-architecture/
1) Client Tier - Front End라고도 불린다. 
2) Application Tier - 비즈니스 로직 혹은 트랜잭션 레이어라고도 부른다. 클라이언트의 요청에 대해 서버처럼 행동한다. 
Middleware 혹은 Back End라고도 불린다. 주로 어플리케이션 서버를 뜻한다. ASP.NET, PHP
3) Data Tier - 데이터베이스와 그것에 액세스해서 읽고 쓰는 것. MySQL DB
*/